# FabricationPipeInvertElevation Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..FabricationPipeInvertElevation Property
ParameterTypeId Class See Also
---
"Pipe Invert Elevation": This parameter is obsolete. It exists only for compatibility.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId FabricationPipeInvertElevation { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property FabricationPipeInvertElevation As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ FabricationPipeInvertElevation {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace